src/main/java/ok/dht/test/slastin/wrk2/data/puts-15000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.923ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.88ms    1.54ms  37.76ms   98.35%
    Req/Sec    15.85k     1.70k   39.56k    78.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  707.00us
 75.000%    1.03ms
 90.000%    1.56ms
 99.000%    3.92ms
 99.900%   26.69ms
 99.990%   37.28ms
 99.999%   37.79ms
100.000%   37.79ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000            2         1.00
       0.176     0.100000        75469         1.11
       0.310     0.200000       150345         1.25
       0.443     0.300000       225317         1.43
       0.575     0.400000       300125         1.67
       0.707     0.500000       375060         2.00
       0.773     0.550000       412920         2.22
       0.837     0.600000       450055         2.50
       0.902     0.650000       487929         2.86
       0.966     0.700000       525463         3.33
       1.027     0.750000       562907         4.00
       1.055     0.775000       581214         4.44
       1.083     0.800000       600486         5.00
       1.128     0.825000       618869         5.71
       1.248     0.850000       637540         6.67
       1.398     0.875000       656186         8.00
       1.478     0.887500       665597         8.89
       1.563     0.900000       674979        10.00
       1.651     0.912500       684304        11.43
       1.744     0.925000       693721        13.33
       1.840     0.937500       703113        16.00
       1.890     0.943750       707767        17.78
       1.940     0.950000       712428        20.00
       1.993     0.956250       717168        22.86
       2.043     0.962500       721861        26.67
       2.091     0.968750       726522        32.00
       2.121     0.971875       728829        35.56
       2.173     0.975000       731217        40.00
       2.243     0.978125       733526        45.71
       2.337     0.981250       735887        53.33
       2.459     0.984375       738214        64.00
       2.541     0.985938       739377        71.11
       2.811     0.987500       740545        80.00
       3.457     0.989062       741719        91.43
       4.211     0.990625       742888       106.67
       4.983     0.992188       744064       128.00
       5.443     0.992969       744646       142.22
       6.511     0.993750       745235       160.00
       8.015     0.994531       745818       182.86
       9.415     0.995313       746404       213.33
      10.311     0.996094       746989       256.00
      11.575     0.996484       747283       284.44
      12.919     0.996875       747575       320.00
      15.167     0.997266       747868       365.71
      17.903     0.997656       748164       426.67
      20.031     0.998047       748456       512.00
      21.007     0.998242       748600       568.89
      22.287     0.998437       748747       640.00
      23.599     0.998633       748893       731.43
      25.007     0.998828       749040       853.33
      26.911     0.999023       749186      1024.00
      27.775     0.999121       749259      1137.78
      29.039     0.999219       749333      1280.00
      30.303     0.999316       749406      1462.86
      31.615     0.999414       749479      1706.67
      33.279     0.999512       749553      2048.00
      34.175     0.999561       749589      2275.56
      34.943     0.999609       749626      2560.00
      35.551     0.999658       749666      2925.71
      35.999     0.999707       749699      3413.33
      36.479     0.999756       749735      4096.00
      36.703     0.999780       749757      4551.11
      36.895     0.999805       749773      5120.00
      36.991     0.999829       749792      5851.43
      37.151     0.999854       749810      6826.67
      37.247     0.999878       749833      8192.00
      37.279     0.999890       749844      9102.22
      37.311     0.999902       749847     10240.00
      37.407     0.999915       749856     11702.86
      37.503     0.999927       749872     13653.33
      37.535     0.999939       749877     16384.00
      37.535     0.999945       749877     18204.44
      37.567     0.999951       749882     20480.00
      37.599     0.999957       749887     23405.71
      37.631     0.999963       749891     27306.67
      37.663     0.999969       749901     32768.00
      37.663     0.999973       749901     36408.89
      37.663     0.999976       749901     40960.00
      37.695     0.999979       749904     46811.43
      37.727     0.999982       749906     54613.33
      37.759     0.999985       749910     65536.00
      37.759     0.999986       749910     72817.78
      37.759     0.999988       749910     81920.00
      37.759     0.999989       749910     93622.86
      37.791     0.999991       749918    109226.67
      37.791     1.000000       749918          inf
#[Mean    =        0.883, StdDeviation   =        1.538]
#[Max     =       37.760, Total count    =       749918]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899990 requests in 1.00m, 57.51MB read
Requests/sec:  14999.72
Transfer/sec:      0.96MB