src/main/java/ok/dht/test/slastin/wrk2/data/puts-20000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.612ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   600.66us  409.82us   7.57ms   74.90%
    Req/Sec    21.12k     1.54k   30.44k    70.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  581.00us
 75.000%    0.86ms
 90.000%    1.02ms
 99.000%    1.50ms
 99.900%    4.70ms
 99.990%    6.34ms
 99.999%    7.41ms
100.000%    7.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.024     0.000000           44         1.00
       0.141     0.100000       100577         1.11
       0.251     0.200000       200213         1.25
       0.361     0.300000       300306         1.43
       0.471     0.400000       400540         1.67
       0.581     0.500000       500156         2.00
       0.636     0.550000       549948         2.22
       0.691     0.600000       600055         2.50
       0.746     0.650000       650062         2.86
       0.801     0.700000       700363         3.33
       0.856     0.750000       750539         4.00
       0.883     0.775000       775291         4.44
       0.910     0.800000       800139         5.00
       0.937     0.825000       825102         5.71
       0.965     0.850000       850797         6.67
       0.992     0.875000       875571         8.00
       1.006     0.887500       888356         8.89
       1.019     0.900000       900185        10.00
       1.033     0.912500       912936        11.43
       1.047     0.925000       925713        13.33
       1.060     0.937500       937635        16.00
       1.067     0.943750       943996        17.78
       1.074     0.950000       950596        20.00
       1.081     0.956250       956877        22.86
       1.089     0.962500       962638        26.67
       1.108     0.968750       968686        32.00
       1.121     0.971875       971948        35.56
       1.136     0.975000       974910        40.00
       1.169     0.978125       978093        45.71
       1.212     0.981250       981160        53.33
       1.273     0.984375       984302        64.00
       1.319     0.985938       985867        71.11
       1.372     0.987500       987407        80.00
       1.445     0.989062       988968        91.43
       1.547     0.990625       990526       106.67
       1.753     0.992188       992090       128.00
       1.943     0.992969       992869       142.22
       2.171     0.993750       993656       160.00
       2.389     0.994531       994436       182.86
       2.659     0.995313       995216       213.33
       2.967     0.996094       995998       256.00
       3.159     0.996484       996386       284.44
       3.331     0.996875       996776       320.00
       3.547     0.997266       997167       365.71
       3.785     0.997656       997558       426.67
       4.017     0.998047       997948       512.00
       4.131     0.998242       998143       568.89
       4.255     0.998437       998338       640.00
       4.391     0.998633       998533       731.43
       4.547     0.998828       998731       853.33
       4.711     0.999023       998925      1024.00
       4.807     0.999121       999025      1137.78
       4.907     0.999219       999121      1280.00
       4.999     0.999316       999217      1462.86
       5.115     0.999414       999317      1706.67
       5.227     0.999512       999414      2048.00
       5.311     0.999561       999461      2275.56
       5.363     0.999609       999511      2560.00
       5.415     0.999658       999560      2925.71
       5.551     0.999707       999607      3413.33
       5.711     0.999756       999655      4096.00
       5.795     0.999780       999681      4551.11
       5.851     0.999805       999706      5120.00
       5.879     0.999829       999729      5851.43
       5.955     0.999854       999753      6826.67
       6.147     0.999878       999777      8192.00
       6.263     0.999890       999790      9102.22
       6.367     0.999902       999802     10240.00
       6.475     0.999915       999814     11702.86
       6.591     0.999927       999826     13653.33
       6.699     0.999939       999838     16384.00
       6.771     0.999945       999846     18204.44
       6.827     0.999951       999851     20480.00
       6.879     0.999957       999857     23405.71
       6.927     0.999963       999863     27306.67
       7.011     0.999969       999869     32768.00
       7.071     0.999973       999872     36408.89
       7.131     0.999976       999875     40960.00
       7.191     0.999979       999878     46811.43
       7.251     0.999982       999881     54613.33
       7.307     0.999985       999884     65536.00
       7.347     0.999986       999886     72817.78
       7.367     0.999988       999887     81920.00
       7.407     0.999989       999889     93622.86
       7.431     0.999991       999890    109226.67
       7.467     0.999992       999892    131072.00
       7.487     0.999993       999893    145635.56
       7.487     0.999994       999893    163840.00
       7.507     0.999995       999894    187245.71
       7.519     0.999995       999895    218453.33
       7.527     0.999996       999896    262144.00
       7.527     0.999997       999896    291271.11
       7.527     0.999997       999896    327680.00
       7.547     0.999997       999897    374491.43
       7.547     0.999998       999897    436906.67
       7.563     0.999998       999898    524288.00
       7.563     0.999998       999898    582542.22
       7.563     0.999998       999898    655360.00
       7.563     0.999999       999898    748982.86
       7.563     0.999999       999898    873813.33
       7.575     0.999999       999899   1048576.00
       7.575     1.000000       999899          inf
#[Mean    =        0.601, StdDeviation   =        0.410]
#[Max     =        7.572, Total count    =       999899]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199979 requests in 1.00m, 76.67MB read
Requests/sec:  19999.62
Transfer/sec:      1.28MB